## Bash

Bash - это консоль (cli)

## управление терминалом и консолью
сдвинуть лог вверх
`Cnrl L`

очистить экран
`clear`

получить историю
```shell
history
```
перелистывание ранее
`СТРЕЛКА ВНИЗ/вверх`
 
выполнить последнюю команду (из history)

```shell
!!
```
выполнить указанную команду (из списка history)
```shell
!45
```
где `45` ' это порядочный 

остановить процесс вконсоли `Cntl`

получить абсолютный путь к каталогу
```shell
pwd
```
показать содержимое текущего каталога
```shell
ls
```
или подобно
```shell
ls -all
```

показать содержимое указаной папки
```shell
ls Dir_name
```
правила именования каталог файлов:
1. тоько по англ
1. без пробелов и спец. символов
1. если имя файлов или каталога состоит  изнеск. англ слов.,то имяможно создать так:`firstofall`или `first_of_all`
1. в именифайлов лучше указывать расщирение `filename.txt`

выйти из папки
```shell
cd ..
```
вернуться в папку  
```shell
cd -
```
зати в указанную папку 
```shell
cd targetfolder
```
знаки
`/` слэш признак каталога
`\` обратный слэш признак каталога
`|` прямой слеш признак разделения команд

windows:
`\` - корневой каталог
Unix/Linux/androed/macos
`/` - корневой каталог
 
 выйти из текущего каталого на 2 шага вверх
 ```shell
 cd ../..
 ```


#### Создание файлов 
 
создание файлов
```shell
touch file_name.txt
```
редактировать текст файл
```shell
micro file_name.txt
```
- `micro` текстовый редактор командной строки
- сохранить по `Cntr-S` выйти из редактора по `Cntr q`

переименовать файл
```shell
mv old_name new_name
```
копирование файла
```shell
cp name_file.txt Newfolder/
```
переместить файл
```shell
mv file.txt TargetName
```
удалить файл
```shell
touch delFile.txt
```
Удалить папку
```shell
rm -rf
```
создать несколько файлов
```shell
touch{1..3}.txt
```
создать несколько каталогов
```shell
mkdir folderName{1..4}
```
удаление содержимое текущего каталога
```shell
rm -rf *
```
создать структуру проэкта
```
project/
├── css/
├── js/
├── img/
│   └── ico/
├── fonts/
└── pages/
```
создать структуру одной командой
```shell
mkdir -p project/{css,js,img/ico,fonts,pages}
```

### Linux

имя компьютера
```shell
hostname
```
локальный ip
```shell
hostname -i
```
сетевая инфа
```shell
ifconfig 
```
или
```shell
ip -c a
```
пинг
```shell
ping -c 4 ya.ru
```
получить инфу по домену
```shell
whois ozon.ru
```
порты
```shell
netstat -an
```
получить маршруты
```shell
route
```
выйти из сеанса пользователя
```shell
exit
```
перезагрузить
```shell
reboot
```

получить текущее время 
```shell
date
```
календарь
```shell
cal
```
```shell
cal 2017
```
получить общюю инфу по системе
```shell
fastfetch
```
получить общюю инфу по системе
```shell
inxt -F
```































